# IdeaStatiCa.ConnectionApi.Model.ConFoundationBlockDto

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**BlockType** | **ConBlockType** |  | [optional]
**ExistingBlockOperationId** | **int?** |  | [optional]
**ConcreteMaterialId** | **int** |  | [optional]
**OffsetTop** | **double** |  | [optional]
**OffsetBottom** | **double** |  | [optional]
**OffsetLeft** | **double** |  | [optional]
**OffsetRight** | **double** |  | [optional]
**Height** | **double** |  | [optional]
**ShearForceTransfer** | **ConShearForceTransferMethod** |  | [optional]
**ContactType** | **ConBasePlateContactType** |  | [optional]
**MortarThickness** | **double** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)